nguyentri/da-pac/svd/DA14583.svd
	<registers>
	<register>
	<name>QDEC_CLOCKDIV_REG</name>
	<description>Clock divider register</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>clock_divider</name>
	<description>Contains the number of the input clock cycles minus one, that are required to generate one logic clock cycle. </description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>QDEC_CTRL2_REG</name>
	<description>Quad Decoder control register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CHZ_PORT_SEL</name>
	<description>Defines which GPIOs are mapped on Channel Z
0: none
1: P0[0] -&gt; CHZ_A, P0[1] -&gt; CHZ_B
2: P0[2] -&gt; CHZ_A, P0[3] -&gt; CHZ_B
3: P0[4] -&gt; CHZ_A, P0[5] -&gt; CHZ_B
4: P0[6] -&gt; CHZ_A, P0[7] -&gt; CHZ_B
5: P1[0] -&gt; CHZ_A, P1[1] -&gt; CHZ_B
6: P1[2] -&gt; CHZ_A, P1[3] -&gt; CHZ_B
7: P2[3] -&gt; CHZ_A, P2[4] -&gt; CHZ_B
8: P2[5] -&gt; CHZ_A, P2[6] -&gt; CHZ_B
9: P2[7] -&gt; CHZ_A, P2[8] -&gt; CHZ_B
10: P2[9] -&gt; CHZ_A, P2[0] -&gt; CHZ_B
11..15: None</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHY_PORT_SEL</name>
	<description>Defines which GPIOs are mapped on Channel Y
0: none
1: P0[0] -&gt; CHY_A, P0[1] -&gt; CHY_B
2: P0[2] -&gt; CHY_A, P0[3] -&gt; CHY_B
3: P0[4] -&gt; CHY_A, P0[5] -&gt; CHY_B
4: P0[6] -&gt; CHY_A, P0[7] -&gt; CHY_B
5: P1[0] -&gt; CHY_A, P1[1] -&gt; CHY_B
6: P1[2] -&gt; CHY_A, P1[3] -&gt; CHY_B
7: P2[3] -&gt; CHY_A, P2[4] -&gt; CHY_B
8: P2[5] -&gt; CHY_A, P2[6] -&gt; CHY_B
9: P2[7] -&gt; CHY_A, P2[8] -&gt; CHY_B
10: P2[9] -&gt; CHY_A, P2[0] -&gt; CHY_B
11..15: None</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHX_PORT_SEL</name>
	<description>Defines which GPIOs are mapped on Channel X
0: none
1: P0[0] -&gt; CHX_A, P0[1] -&gt; CHX_B
2: P0[2] -&gt; CHX_A, P0[3] -&gt; CHX_B
3: P0[4] -&gt; CHX_A, P0[5] -&gt; CHX_B
4: P0[6] -&gt; CHX_A, P0[7] -&gt; CHX_B
5: P1[0] -&gt; CHX_A, P1[1] -&gt; CHX_B
6: P1[2] -&gt; CHX_A, P1[3] -&gt; CHX_B
7: P2[3] -&gt; CHX_A, P2[4] -&gt; CHX_B
8: P2[5] -&gt; CHX_A, P2[6] -&gt; CHX_B
9: P2[7] -&gt; CHX_A, P2[8] -&gt; CHX_B
10: P2[9] -&gt; CHX_A, P2[0] -&gt; CHX_B
11..15: None</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>QDEC_CTRL_REG</name>
	<description>Quad Decoder control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>QD_IRQ_THRES</name>
	<description>The number of events on either counter (X or Y) that need to be reached before an interrupt is generated. If 0 is written, then threshold is considered to be 1. </description>
	<bitRange>[9:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QD_IRQ_STATUS</name>
	<description>Interrupt Status. If 1 an interrupt has occured. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>QD_IRQ_CLR</name>
	<description>Writing 1 to this bit clears the interrupt. This bit is autocleared </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QD_IRQ_MASK</name>
	<description>0: interrupt is masked
1: interrupt is enabled </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>QDEC_XCNT_REG</name>
	<description>Counter value of the X Axis</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>X_counter</name>
	<description>Contains a signed value of the events. Zero when channel is disabled </description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>QDEC_YCNT_REG</name>
	<description>Counter value of the Y Axis</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>Y_counter</name>
	<description>Contains a signed value of the events. Zero when channel is disabled</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>QDEC_ZCNT_REG</name>
	<description>Z_counter</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>Z_counter</name>
	<description>Contains a signed value of the events. Zero when channel is disabled</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>riscutil580_gpreg_nl01</name>
	<version>1.0</version>
	<description>riscutil580_gpreg_nl01 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003300</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>10</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>DEBUG_REG</name>
	<description>Various debug information register.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DEBUGS_FREEZE_EN</name>
	<description>Default '1', freezing of the on-chip timers is enabled when the Cortex-M0 is halted in DEBUG State.
If '0', freezing of the on-chip timers is depending on FREEZE_REG when the Cortex-M0 is halted in DEBUG State except the watchdog timer. The watchdog timer is always frozen when the Cortex-M0 is halted in DEBUG State. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>GP_CONTROL_REG</name>
	<description>General purpose system control register.</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>EM_MAP</name>
	<description>Select the mapping of the Exchange memory pages.
0: EM size 0 kB, SysRAM size 42 kB
1: EM size 2 kB, SysRAM size 48 kB
2: EM size 3 kB, SysRAM size 47 kB
3: EM size 4 kB, SysRAM size 46 kB
4: EM size 5 kB, SysRAM size 45 kB
5: EM size 6 kB, SysRAM size 44 kB
6: EM size 7 kB, SysRAM size 43 kB
7: EM size 8 kB, SysRAM size 42 kB
8: Reserved
9: EM size 4 kB, SysRAM size 40 kB
10: EM size 5 kB, SysRAM size 40 kB
11: EM size 6 kB, SysRAM size 40 kB
12: EM size 7 kB, SysRAM size 40 kB
13: EM size 8 kB, SysRAM size 40 kB
14: EM size 9 kB, SysRAM size 40 kB
15: EM size 10 kB, SysRAM size 40 kB
16: Reserved
17: EM size 6 kB, SysRAM size 38 kB
18: EM size 7 kB, SysRAM size 38 kB
19: EM size 8 kB, SysRAM size 38 kB
20: EM size 9 kB, SysRAM size 38 kB
21: EM size 10 kB, SysRAM size 38 kB
22: EM size 11 kB, SysRAM size 38 kB
23: EM size 12 kB, SysRAM size 38 kB
other: Reserved. </description>
	<bitRange>[5:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BLE_WAKEUP_REQ</name>
	<description>If '1', the BLE wakes up. Must be kept high at least for 1 low power clock period. 
If the BLE is in deep sleep state, then by setting this bit it will cause the wakeup LP IRQ to be asserted with a delay of 3 to 4 low power cycles.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>GP_STATUS_REG</name>
	<description>General purpose system status register.</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CAL_PHASE</name>
	<description>If '1', it designates that the chip is in Calibration Phase i.e. the OTP has been initially programmed but no Calibration has occured. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RESET_FREEZE_REG</name>
	<description>Controls unfreezing of various timers/counters.</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>FRZ_WDOG</name>
	<description>If '1', the watchdog timer continues, '0' is discarded. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_BLETIM</name>
	<description>If '1', the the BLE master clock continues, '0' is discarded. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SWTIM</name>
	<description>If '1', the SW Timer (TIMER0) continues, '0' is discarded. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_WKUPTIM</name>
	<description>If '1', the Wake Up Timer continues, '0' is discarded. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SET_FREEZE_REG</name>
	<description>Controls freezing of various timers/counters.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>FRZ_WDOG</name>
	<description>If '1', the watchdog timer is frozen, '0' is discarded. WATCHDOG_CTRL_REG[NMI_RST] must be '0' to allow the freeze function. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_BLETIM</name>
	<description>If '1', the BLE master clock is frozen, '0' is discarded. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SWTIM</name>
	<description>If '1', the SW Timer (TIMER0) is frozen, '0' is discarded. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_WKUPTIM</name>
	<description>If '1', the Wake Up Timer is frozen, '0' is discarded. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>riscutil580_wdog_nl00</name>
	<version>1.0</version>
	<description>riscutil580_wdog_nl00 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003100</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>4</size>
	<usage>registers</usage>
</addressBlock>
	
